"""
单字符匹配：
点.   匹配任意1个字符（除了\n），\.匹配点本身
[]  匹配[]中列举的字符，可以写[a-zA-Z0-9]这三种范围组合或指定单个字符如[aceDFG135]
\d  匹配数字0-9
\D  匹配非数字
\s  匹配空白，即空格、tab键
\S  匹配非空白
\w  匹配单词字符，即a-z、A-Z、0-9、_
\W  匹配非单词字符

数量匹配：
*       匹配前一个规则的字符出现0至无数次——r'\d*'表示数字有0个或任意多个
+       匹配前一个规则的字符出现1至无数次——r'\d+'表示数字有至少1个或任意多个
?       匹配前一个规则的字符出现0次或1次——r'\d?'表示数字有0个或1个
{m}     匹配前一个规则的字符出现m次
{m,}    匹配前一个规则的字符出现至少m次
{m,n}   匹配前一个规则的字符出现m到n次——“{m,n}”中间不能有空格！

边界匹配：
^   匹配字符串开头
$   匹配字符串结尾
\b  匹配一个单词的边界
\B  匹配非单词边界

分组匹配：
|   匹配左右任意一个表达式
()  将括号中的字符作为一个分组
"""

import re
s1 = "itheima1 @@python2 !!666 ##itcast3"

result_1 = re.findall(r'[a-zA-Z]', s1) # 找出所有英文字母
print(result_1)

result_2 = re.findall(r'[0-9]', s1)
print(result_2)

result_3 = re.findall(r'\d', s1) # 找出所有数字 0-9
print(result_3) # ['1', '2', '6', '6', '6', '3']
# 字符串前面带上r的标记，表示字符串中转义字符无效，就是普通字符的意思

result_4 = re.findall(r'\W', s1) # 找出所有特殊字符（非单词字符）
print(result_4) # [' ', '@', '@', ' ', '!', '!', ' ', '#', '#']

result_5 = re.findall(r'\s', s1) # 找出所有空白，即空格、tab键
print(result_5) # [' ', ' ', ' ']

result_6 = re.findall(r'[ieo1]', s1) # 找到列举出的单个字符
print(result_6) # ['i', 'e', 'i', '1', 'o', 'i']

# 匹配账号，只能由字母和数字组成，长度限制6到10位
r_1 = '^[0-9a-zA-Z]{6,10}$'
s2 = '123456_'
s3 = '123456'
print(re.findall(r_1, s2)) # []
print(re.findall(r_1, s3)) # ['123456']

# 匹配QQ号，要求纯数字，长度5-11，第一位不为0
# 规则为：^[1-9][0-9]{4,10}$
# [1-9]匹配第一位，[0-9]匹配后面4到10位
r_2 = '^[1-9][0-9]{4,10}$'
s4 = '123453678'
s5 = '0123453678'
print(re.findall(r_2, s4)) # ['123453678']
print(re.findall(r_2, s5)) # []

# 匹配邮箱地址，只允许qq、163、gmail这三种邮箱地址
# 邮箱格式：
# abc.def.ghi@qq.com.cn.eu
# abc@qq.com
# {内容}.{内容}.{内容}.{内容}.{内容}.{内容}.{内容}.{内容}@{内容}.{内容}.{内容}
r_3 = r'(^[\w-]+(\.[\w-]+)*@(qq|163|gmail)(\.[\w-]+)+$)'
s6 = 'a.b.c.d.e.f.g@qq.com.a.b.c.d.e'
s7 = 'a.b.c.d.e.f.g@outlook.com.a.b.c.d.e'
print(re.findall(r_3, s6))
print(re.match(r_3, s6).group())
print(re.match(r_3, s7)) # None

# 字符串前面带上r的标记，表示字符串中转义字符无效，就是普通字符的意思
print(r'\2\3\4\5\\')