# 序列：内容连续，有序，可使用下标索引的一类数据容器
# 列表、元组、字符串 都是序列
# 序列支持切片

# 切片：从一个序列中取出一个子序列
# 语法：序列[起始下标:结束下标:步长]

# 结果为左闭右开 [起始下标元素, 结束下标元素)

# • 起始下标：表示从何处开始，留空则默认为从头开始
# • 结束下标：表示从何处结束，留空则默认为截取到结尾
# • 步长：取元素的间隔，留空则默认为1
# • 步长为 1：一个个取元素
# • 步长为 2：表示跳过1个元素取
# • 步长为 N：表示跳过N-1个元素取
# • 步长为 负：表示反向取元素（注意：起始下标 与 结束下标 也要反向标记）

# 切片不会影响原始序列，而是得到一个新的序列

list1 = [0, 1, 2, 3, 4, 5, 6]

list2 = list1[1: 4]
print(list2)

list3 = list1[3: 1: -1]
print(list3) # [3, 2]

list4 = list1[-1: -len(list1): -1]
print(list4) # [6, 5, 4, 3, 2, 1]

list5 = list1[-1: : -1]
print(list5) # [6, 5, 4, 3, 2, 1, 0]

tuple1 = (0, 1, 2, 3, 4, 5, 6)
tuple2 = tuple1[:] # 从头到尾，步长为1
print(tuple2)

tuple3 = tuple1[: : -2]
print(tuple3) # (6, 4, 2, 0)

str1 = '0123456789'
str2 = str1[: : 3]
print(str2)

str3 = str1[: : -1]
print(str3) # "9876543210"